Documents/омг_УстановкаВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>омг_УстановкаВыработки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.омг_НоменклатураВыработки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Филиалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьДолжностиИСотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураИсключения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоИскл</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураИсключения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/омг_УстановкаВыработки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТабличнаяЧастьДолжностиИСотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если не ЗначениеЗаполнено(Элементы.ТабличнаяЧастьДолжностиИСотрудники.ТекущиеДанные.ИндСтроки) или Копирование Тогда  
		
		Если Копирование Тогда
			
			РодительскийИндСтроки = Элементы.ТабличнаяЧастьДолжностиИСотрудники.ТекущиеДанные.ИндСтроки;
			
		КонецЕсли;
		
		Элементы.ТабличнаяЧастьДолжностиИСотрудники.ТекущиеДанные.ИндСтроки = Новый УникальныйИдентификатор();
		
	КонецЕсли;   
	
	Если Копирование Тогда
		
		ТекИндСтроки = Элементы.ТабличнаяЧастьДолжностиИСотрудники.ТекущиеДанные.ИндСтроки;
		
		НайденныеПозиции = Объект.Номенклатура.НайтиСтроки(Новый Структура("ИндСтроки", РодительскийИндСтроки));
		
		
		Для Каждого СтрокаТаблицы Из НайденныеПозиции Цикл 
			
			СтрНовая = Объект.Номенклатура.Добавить();
			ЗаполнитьЗначенияСвойств(СтрНовая,СтрокаТаблицы);
			СтрНовая.ИндСтроки = ТекИндСтроки; 
			
		КонецЦикла; 
		
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧастьДолжностиИСотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)    
	
	ЭтоИскл = Ложь;
	
	Если Элемент.ТекущийЭлемент = Элементы.ТабличнаяЧасть1НоменклатураИскл Тогда 
		ЭтоИскл = Истина;
	КонецЕсли;	
	
	ИндСтроки = Элементы.ТабличнаяЧастьДолжностиИСотрудники.ТекущиеДанные.ИндСтроки;
	
	НоменклатураОтбор = Новый СписокЗначений;
	
	НайденныеПозиции = Объект.Номенклатура.НайтиСтроки(Новый Структура("ИндСтроки,ЭтоИскл", ИндСтроки,ЭтоИскл));
	
	Для Каждого СтрокаТаблицы Из НайденныеПозиции Цикл 
		
		НоменклатураОтбор.Добавить(СтрокаТаблицы.Номенклатура)
		
	КонецЦикла; 
	
	ПараметрыВыбора2 = Новый Структура();
	
	ПараметрыВыбора2.Вставить("БыстрыйВыбор",Ложь);
	ПараметрыВыбора2.Вставить("ВводСписком",Истина);  
	ПараметрыВыбора2.Вставить("ВыборГруппИЭлементов",ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыВыбора2.Вставить("ЗакрыватьПриВыборе",Истина);
	ПараметрыВыбора2.Вставить("ЗакрыватьПриЗакрытииВладельца",Истина);
	ПараметрыВыбора2.Вставить("ЗначенияДляВыбора",Новый СписокЗначений);
	ПараметрыВыбора2.Вставить("ЗначенияДляВыбораЗаполнены",Ложь);
	ПараметрыВыбора2.Вставить("КлючУникальности","");
	ПараметрыВыбора2.Вставить("МножественныйВыбор",Ложь);
	ПараметрыВыбора2.Вставить("ОграничиватьВыборУказаннымиЗначениями",Ложь);
	ПараметрыВыбора2.Вставить("ОписаниеТипов", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПараметрыВыбора2.Вставить("Отбор",Новый Структура);
	ПараметрыВыбора2.Вставить("ПараметрыВыбора",Новый Массив);
	ПараметрыВыбора2.Вставить("ПутьКФорме","");
	ПараметрыВыбора2.Вставить("РазрешитьНачалоПеретаскивания",Ложь);
	ПараметрыВыбора2.Вставить("РежимВыбора",Истина);
	ПараметрыВыбора2.Вставить("РежимОткрытияОкна",РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("СтрокаИдентификатор", Элемент.ТекущиеДанные.ПолучитьИдентификатор());
	ПараметрыОбработчика.Вставить("ЭтоИскл", ЭтоИскл);	
	ПараметрыОбработчика.Вставить("ИндСтроки", ИндСтроки); 
	ПараметрыОбработчика.Вставить("ЭтоФилиалы", Ложь); 
	
	Обработчик = Новый ОписаниеОповещения("ОтборыЗавершениеВводаСпискомСФлажками", ЭтотОбъект, ПараметрыОбработчика);
	
	ПараметрыВыбора2.Вставить("Отмеченные",    НоменклатураОтбор);
	ПараметрыВыбора2.Вставить("Представление", "Номенклатура");
	
	Блокировать = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыВыбора2, ЭтотОбъект, , , , Обработчик, Блокировать);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтборыЗавершениеВводаСпискомСФлажками(РезультатВыбора, Контекст) Экспорт
	
	Если ТипЗнч(РезультатВыбора) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;  
	
	ИндСтроки = Контекст.ИндСтроки;
	ЭтоИскл   = Контекст.ЭтоИскл; 
	ЭтоФилиалы = Контекст.ЭтоФилиалы;
	
	Если не ЭтоФилиалы Тогда
		НайденныеПозиции = Объект.Номенклатура.НайтиСтроки(Новый Структура("ИндСтроки,ЭтоИскл", ИндСтроки,ЭтоИскл));
		
		Для Каждого СтрокаТаблицы Из НайденныеПозиции Цикл 
			
			Объект.Номенклатура.Удалить(СтрокаТаблицы)
			
		КонецЦикла;
		
		Для Каждого СтрокаТаблицы Из РезультатВыбора Цикл  
			Если ЗначениеЗаполнено(СтрокаТаблицы.Значение) Тогда
				НовНоменклатура = Объект.Номенклатура.Добавить();
				НовНоменклатура.Номенклатура = СтрокаТаблицы.Значение;
				НовНоменклатура.ИндСтроки = ИндСтроки;
				НовНоменклатура.ЭтоИскл = ЭтоИскл;
			КонецЕсли;	
		КонецЦикла;
	иначе
		Объект.Филиалы.Очистить();
		ЗаголовокФилиалы = "";
		Для Каждого СтрокаТаблицы Из РезультатВыбора Цикл 
			Если ЗначениеЗаполнено(СтрокаТаблицы.Значение) Тогда
				НовыйФилал = Объект.Филиалы.Добавить();
				НовыйФилал.Филиал = СтрокаТаблицы.Значение;
				ЗаголовокФилиалы = "" + ЗаголовокФилиалы + НовыйФилал.Филиал + "; ";
			КонецЕсли;
		КонецЦикла;      
		
		Элементы.Декорация1.Заголовок = ЗаголовокФилиалы;  
		
	КонецЕсли;     
	
КонецПроцедуры	

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	
	Филиалы = Новый СписокЗначений;
	
	Для Каждого СтрокаТаблицы Из Объект.Филиалы Цикл 
		
		Филиалы.Добавить(СтрокаТаблицы.Филиал)
		
	КонецЦикла; 	
	
	Филиалы = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Объект.Филиалы Цикл 
		
		Филиалы.Добавить(СтрокаТаблицы.Филиал)
		
	КонецЦикла; 
	
	ПараметрыПодбора = Новый Структура("ИндСтроки, НоменклатураОтбор,ЭтоИскл,ЭтоФилиалы,Организация","", Филиалы,Ложь,Истина,Объект.Организация);
	
	ОбработчикПослеВыбора = Новый ОписаниеОповещения("омг_ПослеВыбораНоменклатурыНабора", ЭтаФорма); 
	
	ОткрытьФорму("Документ.омг_УстановкаВыработки.Форма.ФормаПодбораНоменклатурыИФилиалов",ПараметрыПодбора,ЭтаФорма,УникальныйИдентификатор,,,ОбработчикПослеВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьДолжностиИСотрудникиПередУдалением(Элемент, Отказ)
	
	Если не Отказ Тогда
		
		ТекИндСтроки = Элементы.ТабличнаяЧастьДолжностиИСотрудники.ТекущиеДанные.ИндСтроки;
		
		НайденныеПозицииЭтоИскл = Объект.НоменклатураИсключения.НайтиСтроки(Новый Структура("ИндСтроки", ТекИндСтроки));
		
		НайденныеПозиции = Объект.Номенклатура.НайтиСтроки(Новый Структура("ИндСтроки", ТекИндСтроки));
		
		Для Каждого СтрокаТаблицы Из НайденныеПозицииЭтоИскл Цикл 
			
			Объект.НоменклатураИсключения.Удалить(СтрокаТаблицы);
			
		КонецЦикла;
		
		Для Каждого СтрокаТаблицы Из НайденныеПозиции Цикл 
			
			Объект.Номенклатура.Удалить(СтрокаТаблицы);
			
		КонецЦикла;  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокФилиалы = "Список филиалов: ";
	
	Для Каждого СтрокаТаблицы Из Объект.Филиалы Цикл 
		ЗаголовокФилиалы = "" + ЗаголовокФилиалы + СтрокаТаблицы.Филиал + "; ";
	КонецЦикла; 
	
	Элементы.Декорация1.Заголовок = ЗаголовокФилиалы;

	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();  
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура омг_ПослеВыбораНоменклатурыНабора(Значение,Параметры) Экспорт

	Если не Значение = Неопределено Тогда
		Если Значение.ЭтоФилиалы Тогда  
			ЗаголовокФилиалы = "Список филиалов: ";
			Объект.Филиалы.Очистить();
			Для Каждого СтрокаТаблицы Из Значение.МассивПозиций Цикл 
				Если ЗначениеЗаполнено(СтрокаТаблицы.Значение) Тогда
				НовФилиал = Объект.Филиалы.Добавить();
				НовФилиал.Филиал = СтрокаТаблицы.Значение;
				ЗаголовокФилиалы = "" + ЗаголовокФилиалы + НовФилиал.Филиал + "; ";
				КонецЕсли;
			КонецЦикла;
				 Элементы.Декорация1.Заголовок = ЗаголовокФилиалы;
		Иначе
			
			ИндСтроки = Значение.ИндСтроки;
			ЭтоИскл   = Значение.ЭтоИскл; 
			 	НайденныеПозиции = Объект.Номенклатура.НайтиСтроки(Новый Структура("ИндСтроки,ЭтоИскл", ИндСтроки,ЭтоИскл));
				
				Для Каждого СтрокаТаблицы Из НайденныеПозиции Цикл 
					
					Объект.Номенклатура.Удалить(СтрокаТаблицы)
					
				КонецЦикла;
				
				Для Каждого СтрокаТаблицы Из Значение.МассивПозиций Цикл 
					Если ЗначениеЗаполнено(СтрокаТаблицы) Тогда
					НовНоменклатура = Объект.Номенклатура.Добавить();
					НовНоменклатура.Номенклатура = СтрокаТаблицы;
					НовНоменклатура.ИндСтроки = ИндСтроки;
					НовНоменклатура.ЭтоИскл = ЭтоИскл;
					КонецЕсли;
				КонецЦикла;

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
